MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX170F256B.PIC
              <edc:DCRFieldSemantic edc:cname="PWP184K" edc:desc="First 184K" edc:when="(field &amp; 0x1ff) == 0x147"/>
              <edc:DCRFieldSemantic edc:cname="PWP185K" edc:desc="First 185K" edc:when="(field &amp; 0x1ff) == 0x146"/>
              <edc:DCRFieldSemantic edc:cname="PWP186K" edc:desc="First 186K" edc:when="(field &amp; 0x1ff) == 0x145"/>
              <edc:DCRFieldSemantic edc:cname="PWP187K" edc:desc="First 187K" edc:when="(field &amp; 0x1ff) == 0x144"/>
              <edc:DCRFieldSemantic edc:cname="PWP188K" edc:desc="First 188K" edc:when="(field &amp; 0x1ff) == 0x143"/>
              <edc:DCRFieldSemantic edc:cname="PWP189K" edc:desc="First 189K" edc:when="(field &amp; 0x1ff) == 0x142"/>
              <edc:DCRFieldSemantic edc:cname="PWP190K" edc:desc="First 190K" edc:when="(field &amp; 0x1ff) == 0x141"/>
              <edc:DCRFieldSemantic edc:cname="PWP191K" edc:desc="First 191K" edc:when="(field &amp; 0x1ff) == 0x140"/>
              <edc:DCRFieldSemantic edc:cname="PWP192K" edc:desc="First 192K" edc:when="(field &amp; 0x1ff) == 0x13f"/>
              <edc:DCRFieldSemantic edc:cname="PWP193K" edc:desc="First 193K" edc:when="(field &amp; 0x1ff) == 0x13e"/>
              <edc:DCRFieldSemantic edc:cname="PWP194K" edc:desc="First 194K" edc:when="(field &amp; 0x1ff) == 0x13d"/>
              <edc:DCRFieldSemantic edc:cname="PWP195K" edc:desc="First 195K" edc:when="(field &amp; 0x1ff) == 0x13c"/>
              <edc:DCRFieldSemantic edc:cname="PWP196K" edc:desc="First 196K" edc:when="(field &amp; 0x1ff) == 0x13b"/>
              <edc:DCRFieldSemantic edc:cname="PWP197K" edc:desc="First 197K" edc:when="(field &amp; 0x1ff) == 0x13a"/>
              <edc:DCRFieldSemantic edc:cname="PWP198K" edc:desc="First 198K" edc:when="(field &amp; 0x1ff) == 0x139"/>
              <edc:DCRFieldSemantic edc:cname="PWP199K" edc:desc="First 199K" edc:when="(field &amp; 0x1ff) == 0x138"/>
              <edc:DCRFieldSemantic edc:cname="PWP200K" edc:desc="First 200K" edc:when="(field &amp; 0x1ff) == 0x137"/>
              <edc:DCRFieldSemantic edc:cname="PWP201K" edc:desc="First 201K" edc:when="(field &amp; 0x1ff) == 0x136"/>
              <edc:DCRFieldSemantic edc:cname="PWP202K" edc:desc="First 202K" edc:when="(field &amp; 0x1ff) == 0x135"/>
              <edc:DCRFieldSemantic edc:cname="PWP203K" edc:desc="First 203K" edc:when="(field &amp; 0x1ff) == 0x134"/>
              <edc:DCRFieldSemantic edc:cname="PWP204K" edc:desc="First 204K" edc:when="(field &amp; 0x1ff) == 0x133"/>
              <edc:DCRFieldSemantic edc:cname="PWP205K" edc:desc="First 205K" edc:when="(field &amp; 0x1ff) == 0x132"/>
              <edc:DCRFieldSemantic edc:cname="PWP206K" edc:desc="First 206K" edc:when="(field &amp; 0x1ff) == 0x131"/>
              <edc:DCRFieldSemantic edc:cname="PWP207K" edc:desc="First 207K" edc:when="(field &amp; 0x1ff) == 0x130"/>
              <edc:DCRFieldSemantic edc:cname="PWP208K" edc:desc="First 208K" edc:when="(field &amp; 0x1ff) == 0x12f"/>
              <edc:DCRFieldSemantic edc:cname="PWP209K" edc:desc="First 209K" edc:when="(field &amp; 0x1ff) == 0x12e"/>
              <edc:DCRFieldSemantic edc:cname="PWP210K" edc:desc="First 210K" edc:when="(field &amp; 0x1ff) == 0x12d"/>
              <edc:DCRFieldSemantic edc:cname="PWP211K" edc:desc="First 211K" edc:when="(field &amp; 0x1ff) == 0x12c"/>
              <edc:DCRFieldSemantic edc:cname="PWP212K" edc:desc="First 212K" edc:when="(field &amp; 0x1ff) == 0x12b"/>
              <edc:DCRFieldSemantic edc:cname="PWP213K" edc:desc="First 213K" edc:when="(field &amp; 0x1ff) == 0x12a"/>
              <edc:DCRFieldSemantic edc:cname="PWP214K" edc:desc="First 214K" edc:when="(field &amp; 0x1ff) == 0x129"/>
              <edc:DCRFieldSemantic edc:cname="PWP215K" edc:desc="First 215K" edc:when="(field &amp; 0x1ff) == 0x128"/>
              <edc:DCRFieldSemantic edc:cname="PWP216K" edc:desc="First 216K" edc:when="(field &amp; 0x1ff) == 0x127"/>
              <edc:DCRFieldSemantic edc:cname="PWP217K" edc:desc="First 217K" edc:when="(field &amp; 0x1ff) == 0x126"/>
              <edc:DCRFieldSemantic edc:cname="PWP218K" edc:desc="First 218K" edc:when="(field &amp; 0x1ff) == 0x125"/>
              <edc:DCRFieldSemantic edc:cname="PWP219K" edc:desc="First 219K" edc:when="(field &amp; 0x1ff) == 0x124"/>
              <edc:DCRFieldSemantic edc:cname="PWP220K" edc:desc="First 220K" edc:when="(field &amp; 0x1ff) == 0x123"/>
              <edc:DCRFieldSemantic edc:cname="PWP221K" edc:desc="First 221K" edc:when="(field &amp; 0x1ff) == 0x122"/>
              <edc:DCRFieldSemantic edc:cname="PWP222K" edc:desc="First 222K" edc:when="(field &amp; 0x1ff) == 0x121"/>
              <edc:DCRFieldSemantic edc:cname="PWP223K" edc:desc="First 223K" edc:when="(field &amp; 0x1ff) == 0x120"/>
              <edc:DCRFieldSemantic edc:cname="PWP224K" edc:desc="First 224K" edc:when="(field &amp; 0x1ff) == 0x11f"/>
              <edc:DCRFieldSemantic edc:cname="PWP225K" edc:desc="First 225K" edc:when="(field &amp; 0x1ff) == 0x11e"/>
              <edc:DCRFieldSemantic edc:cname="PWP226K" edc:desc="First 226K" edc:when="(field &amp; 0x1ff) == 0x11d"/>
              <edc:DCRFieldSemantic edc:cname="PWP227K" edc:desc="First 227K" edc:when="(field &amp; 0x1ff) == 0x11c"/>
              <edc:DCRFieldSemantic edc:cname="PWP228K" edc:desc="First 228K" edc:when="(field &amp; 0x1ff) == 0x11b"/>
              <edc:DCRFieldSemantic edc:cname="PWP229K" edc:desc="First 229K" edc:when="(field &amp; 0x1ff) == 0x11a"/>
              <edc:DCRFieldSemantic edc:cname="PWP230K" edc:desc="First 230K" edc:when="(field &amp; 0x1ff) == 0x119"/>
              <edc:DCRFieldSemantic edc:cname="PWP231K" edc:desc="First 231K" edc:when="(field &amp; 0x1ff) == 0x118"/>
              <edc:DCRFieldSemantic edc:cname="PWP232K" edc:desc="First 232K" edc:when="(field &amp; 0x1ff) == 0x117"/>
              <edc:DCRFieldSemantic edc:cname="PWP233K" edc:desc="First 233K" edc:when="(field &amp; 0x1ff) == 0x116"/>
              <edc:DCRFieldSemantic edc:cname="PWP234K" edc:desc="First 234K" edc:when="(field &amp; 0x1ff) == 0x115"/>
              <edc:DCRFieldSemantic edc:cname="PWP235K" edc:desc="First 235K" edc:when="(field &amp; 0x1ff) == 0x114"/>
              <edc:DCRFieldSemantic edc:cname="PWP236K" edc:desc="First 236K" edc:when="(field &amp; 0x1ff) == 0x113"/>
              <edc:DCRFieldSemantic edc:cname="PWP237K" edc:desc="First 237K" edc:when="(field &amp; 0x1ff) == 0x112"/>
              <edc:DCRFieldSemantic edc:cname="PWP238K" edc:desc="First 238K" edc:when="(field &amp; 0x1ff) == 0x111"/>
              <edc:DCRFieldSemantic edc:cname="PWP239K" edc:desc="First 239K" edc:when="(field &amp; 0x1ff) == 0x110"/>
              <edc:DCRFieldSemantic edc:cname="PWP240K" edc:desc="First 240K" edc:when="(field &amp; 0x1ff) == 0x10f"/>
              <edc:DCRFieldSemantic edc:cname="PWP241K" edc:desc="First 241K" edc:when="(field &amp; 0x1ff) == 0x10e"/>
              <edc:DCRFieldSemantic edc:cname="PWP242K" edc:desc="First 242K" edc:when="(field &amp; 0x1ff) == 0x10d"/>
              <edc:DCRFieldSemantic edc:cname="PWP243K" edc:desc="First 243K" edc:when="(field &amp; 0x1ff) == 0x10c"/>
              <edc:DCRFieldSemantic edc:cname="PWP244K" edc:desc="First 244K" edc:when="(field &amp; 0x1ff) == 0x10b"/>
              <edc:DCRFieldSemantic edc:cname="PWP245K" edc:desc="First 245K" edc:when="(field &amp; 0x1ff) == 0x10a"/>
              <edc:DCRFieldSemantic edc:cname="PWP246K" edc:desc="First 246K" edc:when="(field &amp; 0x1ff) == 0x109"/>
              <edc:DCRFieldSemantic edc:cname="PWP247K" edc:desc="First 247K" edc:when="(field &amp; 0x1ff) == 0x108"/>
              <edc:DCRFieldSemantic edc:cname="PWP248K" edc:desc="First 248K" edc:when="(field &amp; 0x1ff) == 0x107"/>
              <edc:DCRFieldSemantic edc:cname="PWP249K" edc:desc="First 249K" edc:when="(field &amp; 0x1ff) == 0x106"/>
              <edc:DCRFieldSemantic edc:cname="PWP250K" edc:desc="First 250K" edc:when="(field &amp; 0x1ff) == 0x105"/>
              <edc:DCRFieldSemantic edc:cname="PWP251K" edc:desc="First 251K" edc:when="(field &amp; 0x1ff) == 0x104"/>
              <edc:DCRFieldSemantic edc:cname="PWP252K" edc:desc="First 252K" edc:when="(field &amp; 0x1ff) == 0x103"/>
              <edc:DCRFieldSemantic edc:cname="PWP253K" edc:desc="First 253K" edc:when="(field &amp; 0x1ff) == 0x102"/>
              <edc:DCRFieldSemantic edc:cname="PWP254K" edc:desc="First 254K" edc:when="(field &amp; 0x1ff) == 0x101"/>
              <edc:DCRFieldSemantic edc:cname="PWP255K" edc:desc="First 255K" edc:when="(field &amp; 0x1ff) == 0x100"/>
              <edc:DCRFieldSemantic edc:cname="PWP256K" edc:desc="First 256K" edc:when="(field &amp; 0x1ff) == 0x0ff"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="BWP" edc:desc="Boot Flash Write Protect bit" edc:mask="0x1" edc:name="BWP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x1d000000" edc:checksumalgo="0x80" edc:endaddr="0x1d07ffff"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x20" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x10000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:kuseg="0x7f000000" edc:regionid="kseg1_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f80a400" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01385_wdt_pwrt_pb_v2.Module" edc:_refcount="1" edc:access="----------------n--------rrrrrnn" edc:cname="WDTCON" edc:desc="" edc:grp="WDT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--------xxxxxxx" edc:name="WDTCON" edc:nzwidth="0x20" edc:por="----------------0--------00000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTCLR" edc:desc="" edc:mask="0x1" edc:name="WDTCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS" edc:desc="" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SWDTPS0" edc:desc="" edc:mask="0x1" edc:name="SWDTPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS1" edc:desc="" edc:mask="0x1" edc:name="SWDTPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS2" edc:desc="" edc:mask="0x1" edc:name="SWDTPS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS3" edc:desc="" edc:mask="0x1" edc:name="SWDTPS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS4" edc:desc="" edc:mask="0x1" edc:name="SWDTPS4" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPSTA" edc:desc="" edc:mask="0x1" edc:name="WDTPSTA" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1" edc:name="WDTPS" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
